//################################## ~~~ Работа с if-else ~~~ ##################################
/* 1 Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
 Проверьте работу скрипта при a, равном 1, 0, -3.
*/
// const a = -3;
// if (a === 0) {
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

/* 2 Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'.
 Проверьте работу скрипта при a, равном 1, 0, -3.*/
// const a = 1;
// if (a > 0) {
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }
/* 3 Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'.
 Проверьте работу скрипта при a, равном 1, 0, -3.*/
// const a = -3;
// if (a < 0) {
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }
/* 4 Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
 Проверьте работу скрипта при a, равном 1, 0, -3.*/

// const a = 1;
// if (a >= 0) {
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }
/* 5 Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
 Проверьте работу скрипта при a, равном 1, 0, -3.*/
// const a = -3;
// if (a <= 0) {
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

/* 6 Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
 Проверьте работу скрипта при a, равном 1, 0, -3.*/
// const a = 1;
// if (a != 0) {
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

/* 7 Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'. 
Проверьте работу скрипта при a, равном 'test', 'тест', 3.*/

// const a = 3;
// if (a === "test") {
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }
/* 8 Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'.
 Проверьте работу скрипта при a, равном '1', 1, 3.*/
// const a = 1;
// if (a === "1") {
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }

//################################## ~~~ Работа с логическими переменными ~~~ ##################################

/* 1  Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false. 
Напишите два варианта скрипта - с короткой записью и с длинной.*/
// //Первый способ
// let test = false;
// if (test) {
//     console.log("Верно");
// } else {
//     console.log("Неверно");
// }
// //Второй способ
// let result = test ? console.log("Верно") : console.log("Неверно");

/* 2 Если переменная test не равна true, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false.
 Напишите два варианта скрипта - с короткой записью и с длинной.*/
// //Первый способ
// let test = false;
// // if (test) {
// //     console.log("Неверно");
// // } else {
// //     console.log("Верно");
// // }
// //Второй способ
// let result = test ? console.log("Неверно") : console.log("Верно");

//################################## ~~~ Работа с && (и) и || (или) ~~~ ##################################

/* 1*/
/**/
/**/
/**/
